app/controllers/friends_controller.rb

UPDATE "friends" SET "first_name" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["first_name", "asdasdasasdasd"], ["updated_at", "2022-03-22 14:07:17.260033"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)